// Задача 29: Напишите программу, которая
// задаёт массив из 8 элементов и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

Console.Write("Программа вывода массива из 8 элементов на экран.\r\n");
Console.WriteLine("");

Console.Write("Введите числа через запятую: ");